Public Attributes | List of all members
API_AnalyticalLink_RigidSettings Struct Reference
Analytical Model
Describes the rigidity settings on both sides of the Structural Analytical Model Analytical Link element. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalLink_RigidLinkConnectionType  | startConnectionType
The start connection type.
API_AnalyticalLink_RigidLinkConnectionType  | endConnectionType
The end connection type.
Detailed Description
Describes the rigidity settings on both sides of the Structural Analytical Model Analytical Link element.
Since
Archicad 25
Member Data Documentation
◆ endConnectionType
 API_AnalyticalLink_RigidSettings::endConnectionType
The end connection type.
◆ startConnectionType
 API_AnalyticalLink_RigidSettings::startConnectionType
The start connection type.